zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/periph/PERI_XBARA.h
/*
** ###################################################################
**     Processors:          MC56F81643LVLC
**                          MC56F81646LVLF
**                          MC56F81648LVLH
**                          MC56F81663LVLC
**                          MC56F81666LVLF
**                          MC56F81668LVLH
**                          MC56F81743LVLC
**                          MC56F81746LMLF
**                          MC56F81746LVLF
**                          MC56F81748LMLH
**                          MC56F81748LVLH
**                          MC56F81763LVLC
**                          MC56F81766AMLFA
**                          MC56F81766LMLF
**                          MC56F81766LVLF
**                          MC56F81768AMLHA
**                          MC56F81768LMLH
**                          MC56F81768LVLH
**                          MC56F81866AMLFA
**                          MC56F81866LVLF
**                          MC56F81868AMLHA
**                          MC56F81868LVLH
**
**     Version:             rev. 1.0, 2024-10-29
**     Build:               b250520
**
**     Abstract:
**         CMSIS Peripheral Access Layer for XBARA
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2019-12-10)
**         Initial version.
**     - rev. 1.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_XBARA.h
 * @version 1.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for XBARA
 *
 * CMSIS Peripheral Access Layer for XBARA
 */

#if !defined(PERI_XBARA_H_)
#define PERI_XBARA_H_                            /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MC56F81643LVLC))
#include "MC56F81643_COMMON.h"
#elif (defined(CPU_MC56F81646LVLF))
#include "MC56F81646_COMMON.h"
#elif (defined(CPU_MC56F81648LVLH))
#include "MC56F81648_COMMON.h"
#elif (defined(CPU_MC56F81663LVLC))
#include "MC56F81663_COMMON.h"
#elif (defined(CPU_MC56F81666LVLF))
#include "MC56F81666_COMMON.h"
#elif (defined(CPU_MC56F81668LVLH))
#include "MC56F81668_COMMON.h"
#elif (defined(CPU_MC56F81743LVLC))
#include "MC56F81743_COMMON.h"
#elif (defined(CPU_MC56F81746LMLF) || defined(CPU_MC56F81746LVLF))
#include "MC56F81746_COMMON.h"
#elif (defined(CPU_MC56F81748LMLH) || defined(CPU_MC56F81748LVLH))
#include "MC56F81748_COMMON.h"
#elif (defined(CPU_MC56F81763LVLC))
#include "MC56F81763_COMMON.h"
#elif (defined(CPU_MC56F81766AMLFA) || defined(CPU_MC56F81766LMLF) || defined(CPU_MC56F81766LVLF))
#include "MC56F81766_COMMON.h"
#elif (defined(CPU_MC56F81768AMLHA) || defined(CPU_MC56F81768LMLH) || defined(CPU_MC56F81768LVLH))
#include "MC56F81768_COMMON.h"
#elif (defined(CPU_MC56F81866AMLFA) || defined(CPU_MC56F81866LVLF))
#include "MC56F81866_COMMON.h"
#elif (defined(CPU_MC56F81868AMLHA) || defined(CPU_MC56F81868LVLH))
#include "MC56F81868_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(XBAR_INPUT_SIGNAL_T_)
#define XBAR_INPUT_SIGNAL_T_
typedef enum _xbar_input_signal
{
    kXBARA_InputVss                 = 0U,          /**< VSS output assigned to XBARA_IN0 input. */
    kXBARA_InputVdd                 = 1U,          /**< VDD output assigned to XBARA_IN1 input. */
    kXBARA_InputXbIn2               = 2U,          /**< XB_IN2 output assigned to XBARA_IN2 input. */
    kXBARA_InputXbIn3               = 3U,          /**< XB_IN3 output assigned to XBARA_IN3 input. */
    kXBARA_InputXbIn4               = 4U,          /**< XB_IN4 output assigned to XBARA_IN4 input. */
    kXBARA_InputXbIn5               = 5U,          /**< XB_IN5 output assigned to XBARA_IN5 input. */
    kXBARA_InputXbIn6               = 6U,          /**< XB_IN6 output assigned to XBARA_IN6 input. */
    kXBARA_InputXbIn7               = 7U,          /**< XB_IN7 output assigned to XBARA_IN7 input. */
    kXBARA_InputXbIn8               = 8U,          /**< XB_IN8 output assigned to XBARA_IN8 input. */
    kXBARA_InputXbIn9               = 9U,          /**< XB_IN9 output assigned to XBARA_IN9 input. */
    kXBARA_InputLpi2c0MSTrig        = 10U,         /**< LPI2C0_M_S_TRIG output assigned to XBARA_IN10 input. */
    kXBARA_InputEwmOutB             = 11U,         /**< EWM_OUT_B output assigned to XBARA_IN11 input. */
    kXBARA_InputCmpaOut             = 12U,         /**< CMPA_OUT output assigned to XBARA_IN12 input. */
    kXBARA_InputCmpbOut             = 13U,         /**< CMPB_OUT output assigned to XBARA_IN13 input. */
    kXBARA_InputCmpcOut             = 14U,         /**< CMPC_OUT output assigned to XBARA_IN14 input. */
    kXBARA_InputCmpdOut             = 15U,         /**< CMPD_OUT output assigned to XBARA_IN15 input. */
    kXBARA_InputAn8Limit            = 16U,         /**< AN8_LIMIT output assigned to XBARA_IN16 input. */
    kXBARA_InputAn9Limit            = 17U,         /**< AN9_LIMIT output assigned to XBARA_IN17 input. */
    kXBARA_InputAn10Limit           = 18U,         /**< AN10_LIMIT output assigned to XBARA_IN18 input. */
    kXBARA_InputAn11Limit           = 19U,         /**< AN11_LIMIT output assigned to XBARA_IN19 input. */
    kXBARA_InputPwma0A              = 20U,         /**< PWMA0_A output assigned to XBARA_IN20 input. */
    kXBARA_InputPwma0B              = 21U,         /**< PWMA0_B output assigned to XBARA_IN21 input. */
    kXBARA_InputPwma1A              = 22U,         /**< PWMA1_A output assigned to XBARA_IN22 input. */
    kXBARA_InputPwma1B              = 23U,         /**< PWMA1_B output assigned to XBARA_IN23 input. */
    kXBARA_InputPwma2A              = 24U,         /**< PWMA2_A output assigned to XBARA_IN24 input. */
    kXBARA_InputPwma2B              = 25U,         /**< PWMA2_B output assigned to XBARA_IN25 input. */
    kXBARA_InputPwma3A              = 26U,         /**< PWMA3_A output assigned to XBARA_IN26 input. */
    kXBARA_InputPwma3B              = 27U,         /**< PWMA3_B output assigned to XBARA_IN27 input. */
    kXBARA_InputPwma0OutTrig0       = 28U,         /**< PWMA0_OUT_TRIG0 output assigned to XBARA_IN28 input. */
    kXBARA_InputPwma0OutTrig1       = 29U,         /**< PWMA0_OUT_TRIG1 output assigned to XBARA_IN29 input. */
    kXBARA_InputPwma1OutTrig0       = 30U,         /**< PWMA1_OUT_TRIG0 output assigned to XBARA_IN30 input. */
    kXBARA_InputPwma1OutTrig1       = 31U,         /**< PWMA1_OUT_TRIG1 output assigned to XBARA_IN31 input. */
    kXBARA_InputPwma2OutTrig0       = 32U,         /**< PWMA2_OUT_TRIG0 output assigned to XBARA_IN32 input. */
    kXBARA_InputPwma2OutTrig1       = 33U,         /**< PWMA2_OUT_TRIG1 output assigned to XBARA_IN33 input. */
    kXBARA_InputPwma3OutTrig0       = 34U,         /**< PWMA3_OUT_TRIG0 output assigned to XBARA_IN34 input. */
    kXBARA_InputPwma3OutTrig1       = 35U,         /**< PWMA3_OUT_TRIG1 output assigned to XBARA_IN35 input. */
    kXBARA_InputAn0LimitTa0Out      = 36U,         /**< AN0_LIMIT_TA0_OUT output assigned to XBARA_IN36 input. */
    kXBARA_InputAn1LimitTa1Out      = 37U,         /**< AN1_LIMIT_TA1_OUT output assigned to XBARA_IN37 input. */
    kXBARA_InputAn2LimitTa2Out      = 38U,         /**< AN2_LIMIT_TA2_OUT output assigned to XBARA_IN38 input. */
    kXBARA_InputAn3LimitTa3Out      = 39U,         /**< AN3_LIMIT_TA3_OUT output assigned to XBARA_IN39 input. */
    kXBARA_InputEvtg0Outa           = 40U,         /**< EVTG0_OUTA output assigned to XBARA_IN40 input. */
    kXBARA_InputEvtg1Outa           = 41U,         /**< EVTG1_OUTA output assigned to XBARA_IN41 input. */
    kXBARA_InputEvtg2Outa           = 42U,         /**< EVTG2_OUTA output assigned to XBARA_IN42 input. */
    kXBARA_InputEvtg3Outa           = 43U,         /**< EVTG3_OUTA output assigned to XBARA_IN43 input. */
    kXBARA_InputPit0SyncOut         = 44U,         /**< PIT0_SYNC_OUT output assigned to XBARA_IN44 input. */
    kXBARA_InputPit1SyncOut         = 45U,         /**< PIT1_SYNC_OUT output assigned to XBARA_IN45 input. */
    kXBARA_InputEvtg0Outb           = 46U,         /**< EVTG0_OUTB output assigned to XBARA_IN46 input. */
    kXBARA_InputEvtg1Outb           = 47U,         /**< EVTG1_OUTB output assigned to XBARA_IN47 input. */
    kXBARA_InputEvtg2Outb           = 48U,         /**< EVTG2_OUTB output assigned to XBARA_IN48 input. */
    kXBARA_InputEvtg3Outb           = 49U,         /**< EVTG3_OUTB output assigned to XBARA_IN49 input. */
    kXBARA_InputQdcPosmatch         = 50U,         /**< QDC_POSMATCH output assigned to XBARA_IN50 input. */
    kXBARA_InputPwmaAllTrig         = 51U,         /**< PWMA_ALL_TRIG output assigned to XBARA_IN51 input. */
    kXBARA_InputSci0RxFull          = 52U,         /**< SCI0_RX_FULL output assigned to XBARA_IN52 input. */
    kXBARA_InputLpi2c1MSTrig        = 53U,         /**< LPI2C1_M_S_TRIG output assigned to XBARA_IN53 input. */
} xbar_input_signal_t;
#endif /* XBAR_INPUT_SIGNAL_T_ */

#if !defined(XBAR_OUTPUT_SIGNAL_T_)
#define XBAR_OUTPUT_SIGNAL_T_
typedef enum _xbar_output_signal
{
    kXBARA_OutputDmaReq0            = 0U,          /**< XBARA_OUT0 output assigned to DMA_REQ0 */
    kXBARA_OutputDmaReq1            = 1U,          /**< XBARA_OUT1 output assigned to DMA_REQ1 */
    kXBARA_OutputDmaReq2            = 2U,          /**< XBARA_OUT2 output assigned to DMA_REQ2 */
    kXBARA_OutputDmaReq3            = 3U,          /**< XBARA_OUT3 output assigned to DMA_REQ3 */
    kXBARA_OutputXbOut4             = 4U,          /**< XBARA_OUT4 output assigned to XB_OUT4 */
    kXBARA_OutputXbOut5             = 5U,          /**< XBARA_OUT5 output assigned to XB_OUT5 */
    kXBARA_OutputXbOut6             = 6U,          /**< XBARA_OUT6 output assigned to XB_OUT6 */
    kXBARA_OutputXbOut7             = 7U,          /**< XBARA_OUT7 output assigned to XB_OUT7 */
    kXBARA_OutputXbOut8             = 8U,          /**< XBARA_OUT8 output assigned to XB_OUT8 */
    kXBARA_OutputXbOut9             = 9U,          /**< XBARA_OUT9 output assigned to XB_OUT9 */
    kXBARA_OutputXbOut10            = 10U,         /**< XBARA_OUT10 output assigned to XB_OUT10 */
    kXBARA_OutputXbOut11            = 11U,         /**< XBARA_OUT11 output assigned to XB_OUT11 */
    kXBARA_OutputAdcSync0           = 12U,         /**< XBARA_OUT12 output assigned to ADC_SYNC0 */
    kXBARA_OutputAdcSync1           = 13U,         /**< XBARA_OUT13 output assigned to ADC_SYNC1 */
    kXBARA_OutputOpampaOpampbCfgSelB1C1 = 14U,     /**< XBARA_OUT14 output assigned to OPAMPA_OPAMPB_CFG_SEL_B1_C1 */
    kXBARA_OutputDaca12bSync        = 15U,         /**< XBARA_OUT15 output assigned to DACA_12B_SYNC */
    kXBARA_OutputCmpa               = 16U,         /**< XBARA_OUT16 output assigned to CMPA */
    kXBARA_OutputCmpb               = 17U,         /**< XBARA_OUT17 output assigned to CMPB */
    kXBARA_OutputCmpc               = 18U,         /**< XBARA_OUT18 output assigned to CMPC */
    kXBARA_OutputCmpd               = 19U,         /**< XBARA_OUT19 output assigned to CMPD */
    kXBARA_OutputPwma0Exta          = 20U,         /**< XBARA_OUT20 output assigned to PWMA0_EXTA */
    kXBARA_OutputPwma1Exta          = 21U,         /**< XBARA_OUT21 output assigned to PWMA1_EXTA */
    kXBARA_OutputPwma2Exta          = 22U,         /**< XBARA_OUT22 output assigned to PWMA2_EXTA */
    kXBARA_OutputPwma3Exta          = 23U,         /**< XBARA_OUT23 output assigned to PWMA3_EXTA */
    kXBARA_OutputPwma0ExtSync       = 24U,         /**< XBARA_OUT24 output assigned to PWMA0_EXT_SYNC */
    kXBARA_OutputPwma1ExtSync       = 25U,         /**< XBARA_OUT25 output assigned to PWMA1_EXT_SYNC */
    kXBARA_OutputPwma2ExtSync       = 26U,         /**< XBARA_OUT26 output assigned to PWMA2_EXT_SYNC */
    kXBARA_OutputPwma3ExtSync       = 27U,         /**< XBARA_OUT27 output assigned to PWMA3_EXT_SYNC */
    kXBARA_OutputPwmaExtClk         = 28U,         /**< XBARA_OUT28 output assigned to PWMA_EXT_CLK */
    kXBARA_OutputPwmaFault0         = 29U,         /**< XBARA_OUT29 output assigned to PWMA_FAULT0 */
    kXBARA_OutputPwmaFault1         = 30U,         /**< XBARA_OUT30 output assigned to PWMA_FAULT1 */
    kXBARA_OutputPwmaFault2         = 31U,         /**< XBARA_OUT31 output assigned to PWMA_FAULT2 */
    kXBARA_OutputPwmaFault3         = 32U,         /**< XBARA_OUT32 output assigned to PWMA_FAULT3 */
    kXBARA_OutputPwmaForce          = 33U,         /**< XBARA_OUT33 output assigned to PWMA_FORCE */
    kXBARA_OutputOpampaCfgSelB0C0   = 34U,         /**< XBARA_OUT34 output assigned to OPAMPA_CFG_SEL_B0_C0 */
    kXBARA_OutputOpampbCfgSelB0C0   = 35U,         /**< XBARA_OUT35 output assigned to OPAMPB_CFG_SEL_B0_C0 */
    kXBARA_OutputSci0Rxd            = 36U,         /**< XBARA_OUT36 output assigned to SCI0_RXD */
    kXBARA_OutputSci1Rxd            = 37U,         /**< XBARA_OUT37 output assigned to SCI1_RXD */
    kXBARA_OutputTa0In              = 38U,         /**< XBARA_OUT38 output assigned to TA0_IN */
    kXBARA_OutputTa1In              = 39U,         /**< XBARA_OUT39 output assigned to TA1_IN */
    kXBARA_OutputTa2In              = 40U,         /**< XBARA_OUT40 output assigned to TA2_IN */
    kXBARA_OutputTa3In              = 41U,         /**< XBARA_OUT41 output assigned to TA3_IN */
    kXBARA_OutputQdcPha             = 42U,         /**< XBARA_OUT42 output assigned to QDC_PHA */
    kXBARA_OutputQdcPhb             = 43U,         /**< XBARA_OUT43 output assigned to QDC_PHB */
    kXBARA_OutputQdcIndex           = 44U,         /**< XBARA_OUT44 output assigned to QDC_INDEX */
    kXBARA_OutputQdcHome            = 45U,         /**< XBARA_OUT45 output assigned to QDC_HOME */
    kXBARA_OutputQdcTrig            = 46U,         /**< XBARA_OUT46 output assigned to QDC_TRIG */
    kXBARA_OutputEvtg0A             = 47U,         /**< XBARA_OUT47 output assigned to EVTG0_A */
    kXBARA_OutputEvtg0B             = 48U,         /**< XBARA_OUT48 output assigned to EVTG0_B */
    kXBARA_OutputEvtg0C             = 49U,         /**< XBARA_OUT49 output assigned to EVTG0_C */
    kXBARA_OutputEvtg0D             = 50U,         /**< XBARA_OUT50 output assigned to EVTG0_D */
    kXBARA_OutputEvtg1A             = 51U,         /**< XBARA_OUT51 output assigned to EVTG1_A */
    kXBARA_OutputEvtg1B             = 52U,         /**< XBARA_OUT52 output assigned to EVTG1_B */
    kXBARA_OutputEvtg1C             = 53U,         /**< XBARA_OUT53 output assigned to EVTG1_C */
    kXBARA_OutputEvtg1D             = 54U,         /**< XBARA_OUT54 output assigned to EVTG1_D */
    kXBARA_OutputEvtg2A             = 55U,         /**< XBARA_OUT55 output assigned to EVTG2_A */
    kXBARA_OutputEvtg2B             = 56U,         /**< XBARA_OUT56 output assigned to EVTG2_B */
    kXBARA_OutputEvtg2C             = 57U,         /**< XBARA_OUT57 output assigned to EVTG2_C */
    kXBARA_OutputEvtg2D             = 58U,         /**< XBARA_OUT58 output assigned to EVTG2_D */
    kXBARA_OutputEvtg3A             = 59U,         /**< XBARA_OUT59 output assigned to EVTG3_A */
    kXBARA_OutputEvtg3B             = 60U,         /**< XBARA_OUT60 output assigned to EVTG3_B */
    kXBARA_OutputEvtg3C             = 61U,         /**< XBARA_OUT61 output assigned to EVTG3_C */
    kXBARA_OutputEvtg3D             = 62U,         /**< XBARA_OUT62 output assigned to EVTG3_D */
    kXBARA_OutputEwmIn              = 63U,         /**< XBARA_OUT63 output assigned to EWM_IN */
    kXBARA_OutputLpi2c0InTrigHreq   = 64U,         /**< XBARA_OUT64 output assigned to LPI2C0_IN_TRIG_HREQ */
    kXBARA_OutputLpi2c1InTrigHreq   = 65U,         /**< XBARA_OUT65 output assigned to LPI2C1_IN_TRIG_HREQ */
} xbar_output_signal_t;
#endif /* XBAR_OUTPUT_SIGNAL_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


